[Survived] BlockStatement
src/components/About/About.js:9:18
 import Aboutcard from "./AboutCard";
 import Toolstack from "./Toolstack";
 
-function About() {
-  return (
-    <Container fluid className="about-section">
-      <Particle />
-      <Container>
-            <Aboutcard />
-        <h1 className="project-heading">
-          Professional <strong className="purple">Skillset </strong>
-        </h1>
-
-        <Techstack />
-
-        <h1 className="project-heading">
-          <strong className="purple">Tools</strong> I use
-        </h1>
-        <Toolstack />
-
-        <Github />
-      </Container>
-    </Container>
-  );
-}
+function About() {}
 
 export default About;
