[Timeout] BooleanLiteral
src/App.js:22:40
 import "bootstrap/dist/css/bootstrap.min.css";
 
 function App() {
-  const [load, upadateLoad] = useState(true);
+  const [load, upadateLoad] = useState(false);
 
   useEffect(() => {

[Timeout] BlockStatement
src/App.js:24:19
 function App() {
   const [load, upadateLoad] = useState(true);
 
-  useEffect(() => {
-    const timer = setTimeout(() => {
-      upadateLoad(false);
-    }, 1200);
-
-    return () => clearTimeout(timer);
-  }, []);
+  useEffect(() => {}, []);
 
   return (

[Timeout] BlockStatement
src/App.js:25:36
   const [load, upadateLoad] = useState(true);
 
   useEffect(() => {
-    const timer = setTimeout(() => {
-      upadateLoad(false);
-    }, 1200);
+    const timer = setTimeout(() => {}, 1200);
 
     return () => clearTimeout(timer);

[Timeout] BooleanLiteral
src/App.js:26:19
 
   useEffect(() => {
     const timer = setTimeout(() => {
-      upadateLoad(false);
+      upadateLoad(true);
     }, 1200);
 

[Timeout] StringLiteral
src/App.js:35:53
   return (
     <Router>
       <Preloader load={load} />
-      <div className="App" id={load ? "no-scroll" : "scroll"}>
+      <div className="App" id={load ? "no-scroll" : ""}>
         <Navbar />
         <ScrollToTop />
