[Survived] BlockStatement
src/components/About/Github.js:5:19
 import GitHubCalendar from "react-github-calendar";
 import { Row } from "react-bootstrap";
 
-function Github() {
-  return (
-    <Row style={{ justifyContent: "center", paddingBottom: "10px" }}>
-      <h1 className="project-heading" style={{ paddingBottom: "20px" }}>
-        Days I <strong className="purple">Code</strong>
-      </h1>
-      <GitHubCalendar
-        username="sreya-goswami"
-        blockSize={15}
-        blockMargin={5}
-        color="#c084f5"
-        fontSize={16}
-      />
-    </Row>
-  );
-}
+function Github() {}
 
 export default Github;

[Survived] ObjectLiteral
src/components/About/Github.js:7:17
 
 function Github() {
   return (
-    <Row style={{ justifyContent: "center", paddingBottom: "10px" }}>
+    <Row style={{}}>
       <h1 className="project-heading" style={{ paddingBottom: "20px" }}>
         Days I <strong className="purple">Code</strong>

[Survived] StringLiteral
src/components/About/Github.js:7:35
 
 function Github() {
   return (
-    <Row style={{ justifyContent: "center", paddingBottom: "10px" }}>
+    <Row style={{ justifyContent: "", paddingBottom: "10px" }}>
       <h1 className="project-heading" style={{ paddingBottom: "20px" }}>
         Days I <strong className="purple">Code</strong>

[Survived] ObjectLiteral
src/components/About/Github.js:8:46
 function Github() {
   return (
     <Row style={{ justifyContent: "center", paddingBottom: "10px" }}>
-      <h1 className="project-heading" style={{ paddingBottom: "20px" }}>
+      <h1 className="project-heading" style={{}}>
         Days I <strong className="purple">Code</strong>
       </h1>
