[Survived] ObjectLiteral
src/components/Home/Home.js:27:27
                 <strong className="main-name"> Vatsal</strong>
               </h1>
 
-              <div style={{ padding: 50, textAlign: "left" }}>
+              <div style={{}}>
                 <Type />
               </div>
