[Survived] StringLiteral
src/components/Footer.js:24:33
             <li className="social-icons">
               <a
                 href="https://github.com/sreya-goswami"
-                style={{ color: "white" }}
+                style={{ color: "" }}
                 target="_blank" 
                 rel="noopener noreferrer"

[Survived] ObjectLiteral
src/components/Footer.js:44:24
             <li className="social-icons">
               <a
                 href="https://www.instagram.com/vatsal.dhama"
-                style={{ color: "white" }}
+                style={{}}
                 target="_blank" 
                 rel="noopener noreferrer"
