[Killed] BlockStatement
src/components/Home/Type.js:4:17
 import React from "react";
 import Typewriter from "typewriter-effect";
 
-function Type() {
-  return (
-    <Typewriter
-      options={{
-        strings: [
-          "Developer",
-          "Designer",
-          "NLP Enthusiast",
-          "MIR Enthusiast",
-        ],
-        autoStart: true,
-        loop: true,
-        deleteSpeed: 40,
-      }}
-    />
-  );
-}
+function Type() {}
 
 export default Type;
killedBy: renders welcome message in Home component rendered App component
statusReason: Error: Type(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Survived] StringLiteral
src/components/Home/Type.js:10:11
       options={{
         strings: [
           "Developer",
-          "Designer",
+          "",
           "NLP Enthusiast",
           "MIR Enthusiast",

[Survived] BooleanLiteral
src/components/Home/Type.js:14:20
           "NLP Enthusiast",
           "MIR Enthusiast",
         ],
-        autoStart: true,
+        autoStart: false,
         loop: true,
         deleteSpeed: 40,

[Survived] BooleanLiteral
src/components/Home/Type.js:15:15
           "MIR Enthusiast",
         ],
         autoStart: true,
-        loop: true,
+        loop: false,
         deleteSpeed: 40,
       }}
