[Survived] BooleanLiteral
src/components/Navbar.js:22:45
 import { CgFileDocument } from "react-icons/cg";
 
 function NavBar() {
-  const [expand, updateExpanded] = useState(false);
+  const [expand, updateExpanded] = useState(true);
   const [navColour, updateNavbar] = useState(false);
 

[Survived] BooleanLiteral
src/components/Navbar.js:23:46
 
 function NavBar() {
   const [expand, updateExpanded] = useState(false);
-  const [navColour, updateNavbar] = useState(false);
+  const [navColour, updateNavbar] = useState(true);
 
   function scrollHandler() {

[Survived] BlockStatement
src/components/Navbar.js:25:28
   const [expand, updateExpanded] = useState(false);
   const [navColour, updateNavbar] = useState(false);
 
-  function scrollHandler() {
-    if (window.scrollY >= 20) {
-      updateNavbar(true);
-    } else {
-      updateNavbar(false);
-    }
-  }
+  function scrollHandler() {}
 
   window.addEventListener("scroll", scrollHandler);

[Survived] BlockStatement
src/components/Navbar.js:26:31
   const [navColour, updateNavbar] = useState(false);
 
   function scrollHandler() {
-    if (window.scrollY >= 20) {
-      updateNavbar(true);
-    } else {
+    if (window.scrollY >= 20) {} else {
       updateNavbar(false);
     }

[Survived] EqualityOperator
src/components/Navbar.js:26:9
   const [navColour, updateNavbar] = useState(false);
 
   function scrollHandler() {
-    if (window.scrollY >= 20) {
+    if (window.scrollY > 20) {
       updateNavbar(true);
     } else {

[Survived] BooleanLiteral
src/components/Navbar.js:27:20
 
   function scrollHandler() {
     if (window.scrollY >= 20) {
-      updateNavbar(true);
+      updateNavbar(false);
     } else {
       updateNavbar(false);

[Survived] BlockStatement
src/components/Navbar.js:28:12
   function scrollHandler() {
     if (window.scrollY >= 20) {
       updateNavbar(true);
-    } else {
-      updateNavbar(false);
-    }
+    } else {}
   }
 

[Survived] BooleanLiteral
src/components/Navbar.js:29:20
     if (window.scrollY >= 20) {
       updateNavbar(true);
     } else {
-      updateNavbar(false);
+      updateNavbar(true);
     }
   }

[Survived] StringLiteral
src/components/Navbar.js:40:30
       expanded={expand}
       fixed="top"
       expand="md"
-      className={navColour ? "sticky" : "navbar"}
+      className={navColour ? "" : "navbar"}
     >
       <Container>

[Survived] BlockStatement
src/components/Navbar.js:48:26
         </Navbar.Brand>
         <Navbar.Toggle
           aria-controls="responsive-navbar-nav"
-          onClick={() => {
-            updateExpanded(expand ? false : "expanded");
-          }}
+          onClick={() => {}}
         >
           <span></span>

[Survived] BooleanLiteral
src/components/Navbar.js:49:37
         <Navbar.Toggle
           aria-controls="responsive-navbar-nav"
           onClick={() => {
-            updateExpanded(expand ? false : "expanded");
+            updateExpanded(expand ? true : "expanded");
           }}
         >

[Survived] StringLiteral
src/components/Navbar.js:49:45
         <Navbar.Toggle
           aria-controls="responsive-navbar-nav"
           onClick={() => {
-            updateExpanded(expand ? false : "expanded");
+            updateExpanded(expand ? false : "");
           }}
         >

[Survived] ArrowFunction
src/components/Navbar.js:59:51
         <Navbar.Collapse id="responsive-navbar-nav">
           <Nav className="ms-auto" defaultActiveKey="#home">
             <Nav.Item>
-              <Nav.Link as={Link} to="/" onClick={() => updateExpanded(false)}>
+              <Nav.Link as={Link} to="/" onClick={() => undefined}>
                 <AiOutlineHome style={{ marginBottom: "2px" }} /> Home
               </Nav.Link>

[Survived] BooleanLiteral
src/components/Navbar.js:59:72
         <Navbar.Collapse id="responsive-navbar-nav">
           <Nav className="ms-auto" defaultActiveKey="#home">
             <Nav.Item>
-              <Nav.Link as={Link} to="/" onClick={() => updateExpanded(false)}>
+              <Nav.Link as={Link} to="/" onClick={() => updateExpanded(true)}>
                 <AiOutlineHome style={{ marginBottom: "2px" }} /> Home
               </Nav.Link>

[Survived] StringLiteral
src/components/Navbar.js:60:55
           <Nav className="ms-auto" defaultActiveKey="#home">
             <Nav.Item>
               <Nav.Link as={Link} to="/" onClick={() => updateExpanded(false)}>
-                <AiOutlineHome style={{ marginBottom: "2px" }} /> Home
+                <AiOutlineHome style={{ marginBottom: "" }} /> Home
               </Nav.Link>
             </Nav.Item>

[Survived] BooleanLiteral
src/components/Navbar.js:68:47
               <Nav.Link
                 as={Link}
                 to="/about"
-                onClick={() => updateExpanded(false)}
+                onClick={() => updateExpanded(true)}
               >
                 <AiOutlineUser style={{ marginBottom: "2px" }} /> About

[Survived] ArrowFunction
src/components/Navbar.js:68:26
               <Nav.Link
                 as={Link}
                 to="/about"
-                onClick={() => updateExpanded(false)}
+                onClick={() => undefined}
               >
                 <AiOutlineUser style={{ marginBottom: "2px" }} /> About

[Survived] StringLiteral
src/components/Navbar.js:70:55
                 to="/about"
                 onClick={() => updateExpanded(false)}
               >
-                <AiOutlineUser style={{ marginBottom: "2px" }} /> About
+                <AiOutlineUser style={{ marginBottom: "" }} /> About
               </Nav.Link>
             </Nav.Item>

[Survived] ObjectLiteral
src/components/Navbar.js:70:39
                 to="/about"
                 onClick={() => updateExpanded(false)}
               >
-                <AiOutlineUser style={{ marginBottom: "2px" }} /> About
+                <AiOutlineUser style={{}} /> About
               </Nav.Link>
             </Nav.Item>

[Survived] ArrowFunction
src/components/Navbar.js:78:26
               <Nav.Link
                 as={Link}
                 to="/workex"
-                onClick={() => updateExpanded(false)}
+                onClick={() => undefined}
               >
                 <AiOutlineFundProjectionScreen

[Survived] BooleanLiteral
src/components/Navbar.js:78:47
               <Nav.Link
                 as={Link}
                 to="/workex"
-                onClick={() => updateExpanded(false)}
+                onClick={() => updateExpanded(true)}
               >
                 <AiOutlineFundProjectionScreen

[Survived] StringLiteral
src/components/Navbar.js:82:20
               >
                 <AiOutlineFundProjectionScreen
                   style={{ marginBottom: "2px" }}
-                />{" "}
+                />{""}
                 Work Experience
               </Nav.Link>

[Survived] ArrowFunction
src/components/Navbar.js:91:26
               <Nav.Link
                 as={Link}
                 to="/project"
-                onClick={() => updateExpanded(false)}
+                onClick={() => undefined}
               >
                 <AiFillFolderOpen

[Survived] BooleanLiteral
src/components/Navbar.js:91:47
               <Nav.Link
                 as={Link}
                 to="/project"
-                onClick={() => updateExpanded(false)}
+                onClick={() => updateExpanded(true)}
               >
                 <AiFillFolderOpen

[Survived] ObjectLiteral
src/components/Navbar.js:94:26
                 onClick={() => updateExpanded(false)}
               >
                 <AiFillFolderOpen
-                  style={{ marginBottom: "2px" }}
+                  style={{}}
                 />{" "}
                 Projects

[Survived] BooleanLiteral
src/components/Navbar.js:104:47
               <Nav.Link
                 as={Link}
                 to="/resume"
-                onClick={() => updateExpanded(false)}
+                onClick={() => updateExpanded(true)}
               >
                 <CgFileDocument style={{ marginBottom: "2px" }} /> Resume

[Survived] ArrowFunction
src/components/Navbar.js:104:26
               <Nav.Link
                 as={Link}
                 to="/resume"
-                onClick={() => updateExpanded(false)}
+                onClick={() => undefined}
               >
                 <CgFileDocument style={{ marginBottom: "2px" }} /> Resume

[Survived] ObjectLiteral
src/components/Navbar.js:106:40
                 to="/resume"
                 onClick={() => updateExpanded(false)}
               >
-                <CgFileDocument style={{ marginBottom: "2px" }} /> Resume
+                <CgFileDocument style={{}} /> Resume
               </Nav.Link>
             </Nav.Item>

[Survived] StringLiteral
src/components/Navbar.js:106:56
                 to="/resume"
                 onClick={() => updateExpanded(false)}
               >
-                <CgFileDocument style={{ marginBottom: "2px" }} /> Resume
+                <CgFileDocument style={{ marginBottom: "" }} /> Resume
               </Nav.Link>
             </Nav.Item>
