[Survived] BooleanLiteral
src/components/Particle.js:18:21
             },
           },
           line_linked: {
-            enable: false,
+            enable: true,
             opacity: 0.03,
           },

[Survived] StringLiteral
src/components/Particle.js:22:24
             opacity: 0.03,
           },
           move: {
-            direction: "right",
+            direction: "",
             speed: 0.05,
           },

[Survived] ObjectLiteral
src/components/Particle.js:29:19
             value: 1,
           },
           opacity: {
-            anim: {
-              enable: true,
-              speed: 1,
-              opacity_min: 0.05,
-            },
+            anim: {},
           },
         },

[Timeout] BooleanLiteral
src/components/Particle.js:30:23
           },
           opacity: {
             anim: {
-              enable: true,
+              enable: false,
               speed: 1,
               opacity_min: 0.05,

[Timeout] ObjectLiteral
src/components/Particle.js:37:19
           },
         },
         interactivity: {
-          events: {
-            onclick: {
-              enable: true,
-              mode: "push",
-            },
-          },
+          events: {},
           modes: {
             push: {

[Timeout] BooleanLiteral
src/components/Particle.js:39:23
         interactivity: {
           events: {
             onclick: {
-              enable: true,
+              enable: false,
               mode: "push",
             },

[Timeout] ObjectLiteral
src/components/Particle.js:44:19
             },
           },
           modes: {
-            push: {
-              particles_nb: 1,
-            },
+            push: {},
           },
         },

[Timeout] BooleanLiteral
src/components/Particle.js:49:24
             },
           },
         },
-        retina_detect: true,
+        retina_detect: false,
       }}
     />
