[Timeout] BlockStatement
src/components/Pre.js:2:21
 import React from "react";
-function Pre(props) {
-  return <div id={props.load ? "preloader" : "preloader-none"}></div>;
-}
+function Pre(props) {}
 
 export default Pre;
