[Timeout] StringLiteral
src/components/Projects/ProjectCards.js:13:40
       <Card.Img variant="top" src={props.imgPath} alt="card-img" />
       <Card.Body>
         <Card.Title>{props.title}</Card.Title>
-        <Card.Text style={{ textAlign: "justify" }}>
+        <Card.Text style={{ textAlign: "" }}>
           {props.description}
         </Card.Text>

[Timeout] ObjectLiteral
src/components/Projects/ProjectCards.js:13:27
       <Card.Img variant="top" src={props.imgPath} alt="card-img" />
       <Card.Body>
         <Card.Title>{props.title}</Card.Title>
-        <Card.Text style={{ textAlign: "justify" }}>
+        <Card.Text style={{}}>
           {props.description}
         </Card.Text>

[Timeout] StringLiteral
src/components/Projects/ProjectCards.js:18:36
         </Card.Text>
         <Button variant="primary" href={props.ghLink} target="_blank">
           <BsGithub /> &nbsp;
-          {props.isBlog ? "Blog" : "GitHub"}
+          {props.isBlog ? "Blog" : ""}
         </Button>
         {"\n"}

[Timeout] StringLiteral
src/components/Projects/ProjectCards.js:20:10
           <BsGithub /> &nbsp;
           {props.isBlog ? "Blog" : "GitHub"}
         </Button>
-        {"\n"}
+        {""}
         {"\n"}
 

[Timeout] ConditionalExpression
src/components/Projects/ProjectCards.js:25:10
 
         {/* If the component contains Demo link and if it's not a Blog then, it will render the below component  */}
 
-        {!props.isBlog && props.demoLink && (
-          <Button
-            variant="primary"
-            href={props.demoLink}
-            target="_blank"
-            style={{ marginLeft: "10px" }}
-          >
-            <CgWebsite /> &nbsp;
-            {"Demo"}
-          </Button>
-        )}
+        {false}
       </Card.Body>
     </Card>

[Timeout] LogicalOperator
src/components/Projects/ProjectCards.js:25:10
 
         {/* If the component contains Demo link and if it's not a Blog then, it will render the below component  */}
 
-        {!props.isBlog && props.demoLink && (
-          <Button
-            variant="primary"
-            href={props.demoLink}
-            target="_blank"
-            style={{ marginLeft: "10px" }}
-          >
-            <CgWebsite /> &nbsp;
-            {"Demo"}
-          </Button>
-        )}
+        {!props.isBlog && props.demoLink || <Button variant="primary" href={props.demoLink} target="_blank" style={{
+  marginLeft: "10px"
+}}>
+            <CgWebsite /> &nbsp;
+            {"Demo"}
+          </Button>}
       </Card.Body>
     </Card>

[Timeout] ObjectLiteral
src/components/Projects/ProjectCards.js:30:20
             variant="primary"
             href={props.demoLink}
             target="_blank"
-            style={{ marginLeft: "10px" }}
+            style={{}}
           >
             <CgWebsite /> &nbsp;
