[Timeout] ObjectLiteral
src/components/Projects/Projects.js:20:19
         <h1 className="project-heading">
           My Recent <strong className="purple">Projects </strong>
         </h1>
-        <p style={{ color: "white" }}>
+        <p style={{}}>
           Here are a few projects I've worked on recently.
         </p>

[Timeout] StringLiteral
src/components/Projects/Projects.js:20:28
         <h1 className="project-heading">
           My Recent <strong className="purple">Projects </strong>
         </h1>
-        <p style={{ color: "white" }}>
+        <p style={{ color: "" }}>
           Here are a few projects I've worked on recently.
         </p>

[Timeout] StringLiteral
src/components/Projects/Projects.js:23:64
         <p style={{ color: "white" }}>
           Here are a few projects I've worked on recently.
         </p>
-        <Row style={{ justifyContent: "center", paddingBottom: "10px" }}>
+        <Row style={{ justifyContent: "center", paddingBottom: "" }}>
           
           <Col md={4} className="project-card">

[Timeout] BooleanLiteral
src/components/Projects/Projects.js:28:23
           <Col md={4} className="project-card">
             <ProjectCard
               imgPath={chatify}
-              isBlog={false}
+              isBlog={true}
               title="Legend of Jagger"
               description="Made a fully functional 2D RPG game with a linear storyline, location based fight sequences, open world and scoring

[Timeout] BooleanLiteral
src/components/Projects/Projects.js:42:23
           <Col md={4} className="project-card">
             <ProjectCard
               imgPath={bitsOfCode}
-              isBlog={false}
+              isBlog={true}
               title="FoodFast"
               description="Made a Food Delivery app for The college mess."

[Timeout] BooleanLiteral
src/components/Projects/Projects.js:52:23
           <Col md={4} className="project-card">
             <ProjectCard
               imgPath={editor}
-              isBlog={false}
+              isBlog={true}
               title="Block-chain based healthcare app"
               description="Built an ethereum smart contract based web application for flash consultation and appointment booking functionality for a 36hr
