[Timeout] BlockStatement
src/components/Resume/ResumeNew.js:11:19
 function ResumeNew() {
   const [width, setWidth] = useState(1200);
 
-  useEffect(() => {
-    setWidth(window.innerWidth);
-  }, []);
+  useEffect(() => {}, []);
 
   return (

[Timeout] StringLiteral
src/components/Resume/ResumeNew.js:19:59
     <div>
       <Container fluid className="resume-section">
         <Particle />
-        <Row style={{ justifyContent: "center", position: "relative" }}>
+        <Row style={{ justifyContent: "center", position: "" }}>
           <Button
             variant="primary"
