[Timeout] BlockStatement
src/components/ScrollToTop.js:4:24
 import { useEffect } from "react";
 import { useLocation } from "react-router-dom";
 
-function ScrollToTop() {
-  const { pathname } = useLocation();
-  useEffect(() => {
-    window.scrollTo(0, 0);
-  }, [pathname]);
-  return null;
-}
+function ScrollToTop() {}
 
 export default ScrollToTop;

[Timeout] BlockStatement
src/components/ScrollToTop.js:6:19
 
 function ScrollToTop() {
   const { pathname } = useLocation();
-  useEffect(() => {
-    window.scrollTo(0, 0);
-  }, [pathname]);
+  useEffect(() => {}, [pathname]);
   return null;
 }
