[Timeout] StringLiteral
src/components/WorkEx/WorkEx.js:23:39
         <p style={{ color: "white" }}>
           Here are my past and current work experiences
         </p>
-        <Row style={{ justifyContent: "center", paddingBottom: "10px" }}>
+        <Row style={{ justifyContent: "", paddingBottom: "10px" }}>
 
           <Col md={4} className="project-card">

[Timeout] ObjectLiteral
src/components/WorkEx/WorkEx.js:23:21
         <p style={{ color: "white" }}>
           Here are my past and current work experiences
         </p>
-        <Row style={{ justifyContent: "center", paddingBottom: "10px" }}>
+        <Row style={{}}>
 
           <Col md={4} className="project-card">

[Timeout] BooleanLiteral
src/components/WorkEx/WorkEx.js:29:23
             
             <WorkExCards
               imgPath={leaf}
-              isBlog={false}
+              isBlog={true}
               title="Open Source Contributer @IIITB Summer of Code"
               description="Worked on building a food ordering app for college canteen from scratch"
