[Survived] StringLiteral
src/components/WorkEx/WorkExCards.js:18:27
         </Card.Text>
         <Button variant="primary" href={props.ghLink} target="_blank">
           <BsGithub /> &nbsp;
-          {props.isBlog ? "Blog" : "GitHub"}
+          {props.isBlog ? "" : "GitHub"}
         </Button>
         {"\n"}

[Survived] BooleanLiteral
src/components/WorkEx/WorkExCards.js:25:10
 
         {/* If the component contains Demo link and if it's not a Blog then, it will render the below component  */}
 
-        {!props.isBlog && props.demoLink && (
+        {props.isBlog && props.demoLink && (
           <Button
             variant="primary"

[Survived] ConditionalExpression
src/components/WorkEx/WorkExCards.js:25:10
 
         {/* If the component contains Demo link and if it's not a Blog then, it will render the below component  */}
 
-        {!props.isBlog && props.demoLink && (
-          <Button
-            variant="primary"
-            href={props.demoLink}
-            target="_blank"
-            style={{ marginLeft: "10px" }}
-          >
-            <CgWebsite /> &nbsp;
-            {"Demo"}
-          </Button>
-        )}
+        {true}
       </Card.Body>
     </Card>
